Catalogs/РС_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_Контрагенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		
		ПараметрыОтчета = Новый Структура;   
		
		ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		
		РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
		
		РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		НовыйЭлемент = ПоискКонтрагент.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_Контрагенты.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
		
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
		
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура)
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_Контрагенты.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКИНаСервере()
	// РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКИ(Команда)
	ЗаполнитьКИНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОКВЕД2НаСервере()
	// РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКВЕД2(Команда)
	ЗаполнитьОКВЕД2НаСервере();
КонецПроцедуры
